# Pandas
## Dataframe- Special object to data in tabular form(rows and coloumns)

In [3]:
import numpy as np
import pandas as pd

In [5]:
np.random.randint(1,100,10)

array([29, 71, 99,  5, 31,  3, 38, 54, 40, 36])

In [12]:
# try to create a data frame
user_data= {
    "MarksA":np.random.randint(1,100,5),
    "MarksB":np.random.randint(50,100,5),
    "MarksC":np.random.randint(1,100,5),
}

In [13]:
user_data

{'MarksA': array([51, 22, 24, 36, 85]),
 'MarksB': array([68, 90, 86, 88, 64]),
 'MarksC': array([54, 97, 66, 44, 66])}

In [19]:
df=pd.DataFrame(user_data, dtype='float32') # only specify datatype if u want to store in some other dtpe other an default
print(df)

   MarksA  MarksB  MarksC
0    51.0    68.0    54.0
1    22.0    90.0    97.0
2    24.0    86.0    66.0
3    36.0    88.0    44.0
4    85.0    64.0    66.0

In [15]:
df.head(n=3)

   MarksA  MarksB  MarksC
0      51      68      54
1      22      90      97
2      24      86      66

In [18]:
print(df.columns)

Index(['MarksA', 'MarksB', 'MarksC'], dtype='object')

In [20]:
df.to_csv('marks.csv')

In [23]:
my_data=pd.read_csv('marks.csv')
my_data=my_data.drop(columns=['Unnamed: 0'])
print(my_data)

   MarksA  MarksB  MarksC
0    51.0    68.0    54.0
1    22.0    90.0    97.0
2    24.0    86.0    66.0
3    36.0    88.0    44.0
4    85.0    64.0    66.0

# Pandas Basics-2

In [25]:
my_data.describe()

          MarksA     MarksB     MarksC
count   5.000000   5.000000   5.000000
mean   43.600000  79.200000  65.400000
std    25.870833  12.214745  19.919839
min    22.000000  64.000000  44.000000
25%    24.000000  68.000000  54.000000
50%    36.000000  86.000000  66.000000
75%    51.000000  88.000000  66.000000
max    85.000000  90.000000  97.000000

In [26]:
my_data.tail(n=3) # to access last 3 rows

   MarksA  MarksB  MarksC
2    24.0    86.0    66.0
3    36.0    88.0    44.0
4    85.0    64.0    66.0

In [27]:
#Row
df.iloc[3]

MarksA    36.0
MarksB    88.0
MarksC    44.0
Name: 3, dtype: float32

In [29]:
#Row & col
df.iloc[3,1]

88.0

In [30]:
df.iloc[3][1]

88.0

In [35]:
idx = df.columns.get_loc('MarksC')
idx
df.iloc[3,idx]

44.0

In [37]:
idx = [df.columns.get_loc('MarksB'),df.columns.get_loc('MarksC')]
idx
df.iloc[3,idx]

MarksB    88.0
MarksC    44.0
Name: 3, dtype: float32

In [38]:
df.iloc[:3, idx]

   MarksB  MarksC
0    68.0    54.0
1    90.0    97.0
2    86.0    66.0

In [39]:
 df.iloc[:3,[1,2]]

   MarksB  MarksC
0    68.0    54.0
1    90.0    97.0
2    86.0    66.0

### Sort your dataframe

In [41]:
my_data

   MarksA  MarksB  MarksC
0    51.0    68.0    54.0
1    22.0    90.0    97.0
2    24.0    86.0    66.0
3    36.0    88.0    44.0
4    85.0    64.0    66.0

In [47]:
my_data.sort_values(by=["MarksC","MarksA"],ascending=False) # the guy with more marks in sub C will come first

   MarksA  MarksB  MarksC
1    22.0    90.0    97.0
4    85.0    64.0    66.0
2    24.0    86.0    66.0
0    51.0    68.0    54.0
3    36.0    88.0    44.0

In [48]:
data_array=my_data.values

In [50]:
print(type(my_data))

<class 'pandas.core.frame.DataFrame'>

In [51]:
print(my_data.shape)

(5, 3)

In [52]:
print(data_array)

[[51. 68. 54.]
 [22. 90. 97.]
 [24. 86. 66.]
 [36. 88. 44.]
 [85. 64. 66.]]

In [54]:
print(type(data_array))

<class 'numpy.ndarray'>

In [55]:
data_array.shape

(5, 3)

In [56]:
data_array[2,2]

66.0

### Numpy arrays back to DataFrame

In [60]:
new_df=pd.DataFrame(data_array, dtype='int32', columns=["Physics", "Chemistry", "Maths"])